test/tests/timesteppers/foam_controlled_tstep_cfl_insert/buoyantCavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantFoam;

startFrom       startTime;

startTime       0.;

stopAt          endTime;

endTime         3.;

deltaT          0.4;

adjustTimeStep     yes;

maxCo              2.;         // max Courant number

writeControl    timeStep;

writeInterval   1;

purgeWrite      20;

writeFormat     ascii;

writePrecision  15;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //
